Revit 2018 API
Pipe.IsLevelId Method
 Checks if given element id is valid level element.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Since: 2011
Syntax
C#
public static bool IsLevelId(
	Document document,
	ElementId levelId
)
Visual Basic
Public Shared Function IsLevelId ( _
	document As Document, _
	levelId As ElementId _
) As Boolean
Visual C++
public:
static bool IsLevelId(
	Document^ document,
	ElementId^ levelId
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document.
levelId
Type: Autodesk.Revit.DB.ElementId
 ElementId of the level to check.
Return Value
 True if the given level id is valid, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
Pipe Class
Autodesk.Revit.DB.Plumbing Namespace